# Exploration & Cleaning

### Importing Data

In [44]:
import pandas as pd

raw_df = pd.read_csv('../data/raw_data/cdnow.csv')

### Exploring

In [45]:
raw_df.shape

(69659, 4)

In [46]:
raw_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 69659 entries, 0 to 69658
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   customer_id  69659 non-null  int64
 1   date         69659 non-null  object
 2   quantity     69659 non-null  int64
 3   price        69659 non-null  float64
dtypes: float64(1), int64(2), object(1)
memory usage: 2.1+ MB

In [47]:
raw_df.describe()

        customer_id      quantity         price
count  69659.000000  69659.000000  69659.000000
mean   11470.854592      2.410040     35.850581
std     6819.904848      2.333924     35.551864
min        1.000000      1.000000      0.000000
25%     5506.000000      1.000000     14.490000
50%    11410.000000      2.000000     25.980000
75%    17273.000000      3.000000     43.700000
max    23570.000000     99.000000    932.230000

In [48]:
raw_df.head()

   customer_id       date  quantity  price
0            1   1/1/1997         1  11.77
1            2  1/12/1997         1  12.00
2            2  1/12/1997         5  77.00
3            3   1/2/1997         2  20.76
4            3  3/30/1997         2  20.76

In [49]:
raw_df

       customer_id       date  quantity  price
0                1   1/1/1997         1  11.77
1                2  1/12/1997         1  12.00
2                2  1/12/1997         5  77.00
3                3   1/2/1997         2  20.76
4                3  3/30/1997         2  20.76
...            ...        ...       ...    ...
69654        23568   4/5/1997         4  83.74
69655        23568  4/22/1997         1  14.99
69656        23569  3/25/1997         2  25.74
69657        23570  3/25/1997         3  51.12
69658        23570  3/26/1997         2  42.96

[69659 rows x 4 columns]

In [50]:
raw_df['date'] = pd.to_datetime(raw_df['date'])

In [51]:
print('First purchase date -> ', raw_df['date'].min())
print('Last purchase date -> ', raw_df['date'].max())

First purchase date ->  1997-01-01 00:00:00
Last purchase date ->  1998-06-30 00:00:00

### Cleaning

Since the data is high-quality & reliable we don't need to clean it, one thing to note is that the date is being imported as a string so we need to convert it to datetime everytime we import the data

In [52]:
print('Before cleaning size ->', raw_df.size)

Before cleaning size -> 278636

In [53]:
raw_df = raw_df.dropna(subset=['customer_id'])

In [54]:
print('After cleaning size ->', raw_df.size)

After cleaning size -> 278636

### Exporting Data

In [55]:
raw_df.to_csv('../data/processed_data/cleaned_df.csv', index=False)